content/posts/eliva.md
+++
title = "ELIVA"
author = ["Daniel Biasiotto"]
date = 2024-02-28T13:50:00+01:00
tags = ["master", "university", "compsci", "ai"]
draft = false
+++

-   Professori:
    -   N.Balossino, D.Cavagnino, M.Grangetto
-   Digital Image Processing, 3rd ed. Gonzales &amp; Woods


## Introduzione {#introduzione}

-   **Eidomatica** (studio delle immagini)
    -   coinvolge molti ambiti
    -   molte aree di studio e discipline
        -   fisica, matematica
-   la luce è composta da diverse lunghezze d'onda
    -   l'applicazione in particolare determina la gamma di frequenze che è di interesse rilevare tramite sensori
    -   infrarosso, visibile, ultravioletto


## Image Processing {#image-processing}

-   image enhancement
    -   giudicata da un umano
-   image restoration
    -   ripristino dato un danno o modifica conosciuta
-   image analysis
    -   analisi di feature di interesse dell'input
    -   può usare enhancement e restoration come passo preparatorio
-   image compression
    -   riduzione dello spazio occupato
    -   una codifica intermedia, poi ribaltata per recuperare una copia il più possibile simile all'originale
    -   anche applicato ai video
